package lingyuekeji.first;

/**
 * @description: 包含 k 个不同字符的最长子字符串的长度。为了更好地理解这个问题，我们可以分解成以下几个步骤。
 * <p>
 * 题目理解
 * 1.子字符串:字符串的一个连续部分。例如，字符串"abc" 的子字符串包括"a","b""c""ab","bc","abc"。
 * 2.不同字符:子字符串中不重复的字符。例如，子字符串"abc"有3个不同字符，而子字符串"aaa"只有1个不同字符。
 * 3.最长子字符串:在所有满足条件的子字符串中，长度最长的那个。
 * <p>
 * 题目示例
 * 假设我们有一个字符串 s="eceba"和 k =2，我们需要找到最多包含2 个不同字符的最长子字符串,
 * ·子字符串"ece" 包含 2 个不同字符，长度为 3。
 * ·子字符串"ba" 包含 2 个不同字符，长度为 2。
 * 所以，答案是 3.
 * <p>
 * @author: xy.sun06
 * @create: 2024-08-23 17:06
 * @Copyright (c) 2024, © 神州租车（北京）科技有限公司
 */
public class WriteExam {


	public void getSpecial(String s) {

	}

}
